tpi-final-web/app/controllers/books_controller.rb

  def index
    @books = Book.where(user_id: current_user.id)
---
SELECT `books`.* FROM `books` WHERE `books`.`user_id` = 1

  def create
    @book = Book.new(book_params)
    if @book.save
---
INSERT INTO `books` (`title`, `created_at`, `updated_at`, `user_id`) VALUES ('book uno', '2021-02-02 16:13:15.858645', '2021-02-02 16:13:15.858645', 1)

  def update
    authorize @book
    if @book.update(book_params)
---
UPDATE `books` SET `books`.`title` = 'book uno1', `books`.`updated_at` = '2021-02-02 16:13:32.828417' WHERE `books`.`id` = 1

  def destroy
    if @book.is_global
      Note.where(book_id: @book.id).delete_all
---
SELECT `notes`.* FROM `notes` WHERE `notes`.`book_id` = 1